# loc and iloc in DataFrame

 * loc --> name ---> does not excludes
* iloc --> index -->it excleude the last value

In [3]:
#  import the module
import pandas as pd

Locate row: Pandas use the loc attribute to return one or more specific row.

In [4]:
# Data
data = {
    "Name":["Python","java","kafka","C++","C"],
    "Salary":[12,11,3,4,5]
}
# lode data into a DataFrame Object :
df = pd.DataFrame(data)

In [5]:
print(df.loc[0])

Name      Python
Salary        12
Name: 0, dtype: object

In [6]:
# example of returning row 0 and 1
print(df.loc[[0,1]])

     Name  Salary
0  Python      12
1    java      11

In [7]:
print(df.loc[[0,1,3]])

     Name  Salary
0  Python      12
1    java      11
3     C++       4

In [26]:
# file lode
bank = pd.read_csv("C:\\Users\\lenovo\\Desktop\\Downloads\\Data\\bank_client_information.csv")

In [21]:
print(bank)

  First Name Last Name                    Email Postal Code  Net Worth  \
0      Bird      Steve           bird@gmail.com     N94 3M0    5000.00
1       Noah     Small       nsmall@hotmail.com     N8S 14K   10000.00
2       Nina    Keller          azikez@gahew.mr     S1T 4E6    9072.02
3    Chanel      Steve         chanel@gmail.com     N7T 3E6   11072.02
4       Kate      Noor         kate@hotmail.com     K8N 5H6    5000.00
5      Samer        Mo          samer@gmail.com     J7H 3HY  100000.00
6       Heba    Ismail  heba.ismail@hotmail.com     K8Y 3M8   50000.00
7      Laila     Ahmed      Laila.a@hotmail.com     J8Y 3M0   20000.00
8     Joseph    Patton           daafeja@boh.jm     M6U 5U7    2629.13
9       Noah     Moran        guutodi@bigwoc.kw     K2D 4M9    8626.96

   Years with Bank
0                5
1                6
2                7
3               10
4               22
5               26
6               11
7                3
8                1
9               13

In [14]:
# loc

bank[0:3] # not exclude

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7

In [ ]:
# iloc

bank[0:3] # exclude

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7

In [27]:
# last name column set as a index
bank.set_index('Last Name',inplace=True)

In [31]:
bank

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Steve,Bird,bird@gmail.com,N94 3M0,5000.00,5
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Steve,Chanel,chanel@gmail.com,N7T 3E6,11072.02,10
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Mo,Samer,samer@gmail.com,J7H 3HY,100000.00,26
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Patton,Joseph,daafeja@boh.jm,M6U 5U7,2629.13,1
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [ ]:
# loc
# bank.loc['Steve':'Mo'] # Error --> 
# bank.loc[0:6] # error

In [35]:
bank.sort_index(inplace=True)

In [36]:
bank

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Mo,Samer,samer@gmail.com,J7H 3HY,100000.00,26
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Patton,Joseph,daafeja@boh.jm,M6U 5U7,2629.13,1
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6
Steve,Bird,bird@gmail.com,N94 3M0,5000.00,5
Steve,Chanel,chanel@gmail.com,N7T 3E6,11072.02,10

In [38]:
bank.loc['Mo':'Steve']

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Mo,Samer,samer@gmail.com,J7H 3HY,100000.00,26
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22
Patton,Joseph,daafeja@boh.jm,M6U 5U7,2629.13,1
Small,Noah,nsmall@hotmail.com,N8S 14K,10000.00,6
Steve,Bird,bird@gmail.com,N94 3M0,5000.00,5
Steve,Chanel,chanel@gmail.com,N7T 3E6,11072.02,10

In [47]:
# iloc
bank.iloc[0:6]

,First Name,Email,Postal Code,Net Worth,Years with Bank
Last Name,,,,,
Ahmed,Laila,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
Ismail,Heba,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
Keller,Nina,azikez@gahew.mr,S1T 4E6,9072.02,7
Mo,Samer,samer@gmail.com,J7H 3HY,100000.00,26
Moran,Noah,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
Noor,Kate,kate@hotmail.com,K8N 5H6,5000.00,22

In [163]:
import pandas as pd
import numpy as np

In [164]:
x = np.random.randint(1,80,100)
x = pd.DataFrame(x)
x

     0
0   66
1    6
2   40
3   76
4   55
..  ..
95  61
96  62
97  20
98  21
99  59

[100 rows x 1 columns]

In [165]:
# rename
x.rename(columns={0:'Age'},inplace=True)

In [166]:
x

    Age
0    66
1     6
2    40
3    76
4    55
..  ...
95   61
96   62
97   20
98   21
99   59

[100 rows x 1 columns]

 > 12 --> child

 > 18 and <12 --> Teenage
 
 >40 ---> Senior citizen

In [167]:
x['Category']=x['Age']

In [168]:
x['new']=x['Category']

In [174]:
x.loc[(x['Age']>18) & (x['Age']<40),'Age']='Teenage'

C:\Users\lenovo\AppData\Local\Temp\ipykernel_6440\492090038.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Teenage' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  x.loc[(x['Age']>18) & (x['Age']<40),'Age']='Teenage'

In [173]:
x.loc[(x['Age']>18) & (x['Age']<40),'Category']='Senior'

C:\Users\lenovo\AppData\Local\Temp\ipykernel_6440\1753816342.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Senior' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  x.loc[(x['Age']>18) & (x['Age']<40),'Category']='Senior'

In [171]:
x.loc[(x['Age']>=40) ,'new'] = 'Senior Citizen'

In [175]:
x

        Age Category             new
0        66       66  Senior Citizen
1         6        6               6
2        40       40  Senior Citizen
3        76       76  Senior Citizen
4        55       55  Senior Citizen
..      ...      ...             ...
95       61       61  Senior Citizen
96       62       62  Senior Citizen
97  Teenage   Senior              20
98  Teenage   Senior              21
99       59       59  Senior Citizen

[100 rows x 3 columns]

In [15]:
x = pd.DataFrame({'Name':['Python','Java','C++','Kafka','C'],
                  'Age':[23,24,45,45,45],
                  'Course':['DA','DS','DE','SE','CE']})
x

     Name  Age Course
0  Python   23     DA
1    Java   24     DS
2     C++   45     DE
3   Kafka   45     SE
4       C   45     CE

In [16]:
x.iloc[3:,0]

3    Kafka
4        C
Name: Name, dtype: object

In [ ]:
# Age and Course 
x.iloc[2:4,1:]

   Age Course
2   45     DE
3   45     SE

# Groupby

In [30]:
import pandas as pd

In [64]:
# Data
Data = pd.DataFrame({
    'Name':['Python','java','Python','C++','C','HTML'],
    'Salary':[32000,25000,30000,20000,15000,10000],
    'Course':['Data_Analytics','Data_Science','Data_Science','Data_Engineering','Data_Analytics','Data_Science']
})

In [65]:
Data

     Name  Salary            Course
0  Python   32000    Data_Analytics
1    java   25000      Data_Science
2  Python   30000      Data_Science
3     C++   20000  Data_Engineering
4       C   15000    Data_Analytics
5    HTML   10000      Data_Science

In [66]:
# Groupby --> aggrigate at the end
Data.groupby('Course')['Salary'].sum() #unorderd

Course
Data_Analytics      47000
Data_Engineering    20000
Data_Science        65000
Name: Salary, dtype: int64

In [67]:
#  data orderd 
A = Data.groupby('Course')['Salary'].sum()
A.sort_values(ascending=False,inplace=True)
A

Course
Data_Science        65000
Data_Analytics      47000
Data_Engineering    20000
Name: Salary, dtype: int64

In [68]:
# groupby by multipals columns
z=Data.groupby(['Course','Name'])['Salary'].sum()
z.sort_values(ascending=False,inplace=True)
z

Course            Name
Data_Analytics    Python    32000
Data_Science      Python    30000
                  java      25000
Data_Engineering  C++       20000
Data_Analytics    C         15000
Data_Science      HTML      10000
Name: Salary, dtype: int64